# frozen_string_literal: true

require_relative 'config/environment'

data = {
  desert: [
  "Десерт Легенда", 150, "сирно-вершкова маса, всередині печиво буше, тертий фундук, шоколад", 62,
  "Крем-карамель", 200, "вершкове суфле з ноткою карамелі", 55,
  "Сирник з абрикосовим джемом та соусом на вибір", 200, "ванільний/шоколадний/вишневий конфітюр", 72,
  "Тістечко «Тірамісу»", 90, "ніжний десерт з п'янким кавовим післясмаком", 49,
  "Торт «Захер»", 140, "шоколадний бісквітний торт з абрикововим конфітюрем", 75,
  "Фруктовий салат у вафельній корзинці", 200, "вафельна корзинка, ківі, апельсин, банан, полуничний топінг, полуничне морозиво", 43,
  "Чізкейк", 120, "творожний десерт з лимонною кислинкою, апельсиновим желе та соусом з ожини", 49,
  "Шоколадний фондан", 130, "шоколадний бісквітний кекс з рідкою серцевиною, вміст какао в шоколаді Подається з морозивом", 57,
  "Яблучно-ананасовий штрудель", 280, "свіжоспечений штрудель з начинкою з карамелізованого яблука", 92
  ],
  second: [
  "Гречка відварна", 200, " ", 43,
  "Картопля по-домашньому", 200, " ", 37,
  "Картопляне пюре", 200, " ", 33,
  "Квасоля стручкова з маслом та часником", 200, " ", 60,
  "Овочі запечені", 200, "помідора, перець, печериці, цукіні, баклажан, цибуля кримська", 75,
  "Рис дикий з вершками і шпинатом", 150, " ", 57,
  "Банош з бринзою", 200, " ", 60,
  "Вареники з капустою", 350, " ", 68,
  "Вареники з картоплею", 350, " ", 50,
  "Вареники з сиром", 350, " ", 67,
  "Вареники козацькі", 350, "вареники на вибір з сметаною/шкварками та підсмаженою цибулею", 113,
  "Гриби білі у вершках", 150, " ", 117,
  "Деруни з грибною підливою", 300, " ", 75,
  "Деруни з м’ясною підливою", 300, " ", 94,
  "Деруни зі сметаною", 300, " ", 56,
  "Хачапурі зі слоєного тіста з соусом «Песто»", 200, "слоєне тісто на маслі 8 2%, сир: мікс бринза + сулугуні, соус «Песто»", 157,
  "Млинці з грибами та шпинатом", 300, " ", 100,
  "Млинці з курячим жульєном", 300, " ", 128,
  "Млинці з м’ясом під грибним соусом", 300, " ", 162,
  "Млинці з червоною ікрою", 220, " ", 513,
  "Млинці з червоною рибою та шпинатом", 300, " ", 219,
  "Макові млинці з бананом в арахісовому маслі та ванільним соусом", 300, " ", 113,
  "Млинці з малиновим джемом", 200, " ", 50,
  "Млинці з сирно-маковою начинкою", 300, " ", 92,
  "Млинці з сиром та родзинками", 250, " ", 68,
  "Млинці з яблуком, ананасом та карамельним соусом", 300, " ", 85,
  "Пенне з тигровими креветками та сиром пармезан (гостра)", 300, " ", 163,
  "Спагетті Болоньєз", 300, "спагетті з м'ясним соусом на томатній основі", 230, " ", 91,
  "Спагетті з лисичками та стручковою квасолею", 230, " ", 80,
  "Спагетті з чорнилом каракатиці та червоною рибою", 300, " ", 173,
  "Спагетті Карбонара", 230, " ", 93,
  "Тальятелле з курячим філе та томатами конкосе", 290, " ", 87
  ],
  first: [
  "Крем-суп з броколі (гострий)", 300, " ", 75,
  "Борщ український на телятині зі сметаною", 300, " ", 68,
  "Крем-суп з печериць", 300, " ", 69,
  "Курячий бульйон з локшиною", 300, " ", 35,
  "Крем-суп зі шпинату", 300, " ", 89,
  "Крем-суп з гарбуза", 300, " ", 59
  ],
  salad: [
  "Салат «Грецький»", 200, " ", 68,
  "Салат «Цезар» з червоною рибою", 235, " ", 143,
  "Салат «Цезар» з курятиною", 260, " ", 102,
  "Салат «Цезар» з телятиною", 260, " ", 117,
  "Салат «Капрезе»", 200, "свіжа помідора, моцарелла, соус «Песто»", 94,
  "Салат «Мізерія» з олією", 200, " ", 42,
  "Салат «Мізерія» зі сметаною", 200, " ", 42,
  "Салат «Овочевий мікс»", 180, "листя салату, помідора, огірок, перець, кунжут, соняшникова олія", 62,
  "Салат весняний", 200, "творог, огірок, редиска, зеленя цибулька, сметана", 60,
  "Салат з буряка та бринзи", 250, "буряк відварний, бринза, руккола, кунжут, оливкова олія", 59,
  "Салат з теплої телятини, руколи та авокадо", 200, " ", 158,
  "Салат з тигрових креветок та морської капусти", 240, "морська капуста, руккола, помідори чері, тигрові креветки", 148,
  "Салат з червоної риби та помідорів конкосе під вершково-соєвим соусом", 210, "листя салату, філе помідори свіжої, лосось слабосолений, соус Теріякі", 132,
  "Салат з язика та фети", 260, "айзберг, язик відварний, печериці, помідори чері, кримська цибуля, яйце перепелине, фета", 130,
  "Салат зі свіжої капусти на олії", 150, " ", 52
  ],
  other_dishes: [
  "Асорті з м’яса на шпажках з соусами Тартар та ВВQ", 700, "телятина, курятина, свинина, печериці, бекон, перець, картопля запечена, соус: барбекю та тар", 474,
  "Шніцель «Легенда» зі свинини", 450, "свинина в паніровці, картопля запечена, салат з свіжої капусти", 148,
  "Шніцель «Легенда» з телятини", 300, "телятина в паніровці, ожиновий соус", 292,
  "Каре телятини з пюре", 350, "каре з телятини, картопляне пюре та овочевий мікс", 259,
  "Свинина по-домашньому", 220, "смажена свинина з цибулею", 103,
  "Телятина під ожиновим соусом з овочевим пюре", 330, "смажена телятина, овочеве пюре, ожиновий соус", 285,
  "Соковитий стейк з телячої вирізки", 100, " ", 127,
  "Телятина з лисичками у вершках", 240, "телятина тушена у вершках з стручковою фасолею, маринованими лисичками, цибулею", 290,
  "Телятина з овочами в сирному соусі", 260, "телятина, брокколі, морква, перець свіжий, сирний соус", 208,
  "Тефтелі мясні з картопляним пюре", 330, " ", 89,
  "Куряче філе гриль з овочевим міксом", 210, "смажене куряче філе, листя салату, помідора чері, кримська цибуля", 110,
  "Куряче філе з базиліком та сиром під вершково-грибним соусом", 260, " ", 149,
  "Асорті з свіжих овочів", 280, "помідора свіжа, перець свіжий, огірок свіжий, зелень", 68,
  "Карпачо з лосося", 120, " ", 182,
  "Карпачо з телятини", 120, " ", 130,
  "М’ясна збірна", 300, "балик свинний гарячого копчення, балик свинний холодного копчення, в'ялений курячий балик", 212,
  "Оселедець з цибулею", 100, " ", 74,
  "Плато з сирів", 300, "пармезан, фета, моцарелла, маасдам, дор-блю, мед, джем", 153,
  "Рибне асорті", 140, "слабосолений лосось та масляна холодного копчення", 164,
  "Роли з фетою та лососем", 180, "смажений млинець з фетою/вершками та слабосоленим лососем", 133,
  "Сало власного соління з червоним хріном", 170, " ", 67,
  "Соління з діжки", 300, "квашені огірок, помідора, капуста", 52
  ]
}

restourant = Restaurant.find_or_create_by(name: 'Legenda', phone_number: '+380503738202')
data.each do |dish_type, dish|
  types = DishType.find_or_create_by(name: dish_type)
  count = 0
  x = 0
  until count == dish.count
    restourant.dishes.create(name: dish[0 + x], weight: dish[1 + x], describe: dish[2 + x], price: dish[3 + x], dish_type: types)
    count += 1
    x += 4
  end
end
